[
  {
    "name": "Fire",
    "description": "With Fire, there is little in the way of reflection – fire is impulsive – and we have pride, passion, courage, creativity, and impulse. Fire is difficult to contain and is guided by spirit. Fire signs often take the lead and are idealists. These traits are associated with each of the Fire signs. Aries is an innovator, concerned more about the present and the future than the past, and is brave and enthusiastic. Aries initiates and spearheads. Leo, as a Fixed Fire sign, is passionate and loyal, making an excellent manager. Sagittarius is a Mutable Fire sign and is more adaptable and flexible than the other Fire signs, but also fiery and courageous. Sagittarius is often a spiritual leader.",
  },
  {
    "name": "Water",
    "description": "Water signs rely more on their senses than logic. They’re nurturing, perceptive, psychic, and understanding. Cancer is emotional, focused on home and family, and expert at nurturing. Scorpio is expert at understanding deep desires, motivations, and intimate connections. Pisces understands on a spiritual, universal level, and is especially compassionate and impressionable."
  },
  {
    "name": "Earth",
    "description": "Earth signs collect and build (most associated with Taurus), are practical and pragmatic (most associated with Virgo), and materialistic and cautious (most associated with Capricorn). Taurus builds, Virgo labors, and Capricorn manages. Earth signs are grounded in reality. They’re also sensual and very much attached to what they can physically see or touch. Earth signs are skilled at managing and using resources. Earth signs want to know what works and wants to see solid results for their efforts. Order helps Earth signs to feel in control and safe. They’re dependable."
  },
  {
    "name": "Air",
    "description": "Air signs are humanitarian, intellectual, social, and communicative. While Air signs share the same element of Air, they each have a different modality: Gemini is Mutable Air, Libra is Cardinal Air, and Aquarius is Fixed Air. Gemini is considered the most adaptable of the Air signs, and takes on a or mental approach to life, expertly sorting, repatterning, and distributing ideas. Libra is the more action-oriented of the Air signs, and is excellent at comparing, weighing, and valuing ideas and principles. Aquarius is the steadiest and most stubborn of these three signs, and is expert at intuitively grasping the universality of ideas and principles."
  }
]

