[
  {
    "house": 1,
    "attributes": "The image we project to others, the first impression we make, how we start things, our defense mechanisms, our relationship with our immediate environment, our general outlook on life, and our physical appearance."
  },
  {
    "house": 2,
    "attributes": "Money and personal finances, sense of self-worth and basic values, personal possessions."
  },
  {
    "house": 3,
    "attributes": "The lower mind, communication, interactions in our immediate environment, siblings and early environment, neighbors, thoughts, short trips, writing and speaking, how we formulate our thoughts, language skills, media and communications."
  },
  {
    "house": 4,
    "attributes": "Our psychological foundations and roots, family, home life, instinctive behavior, the mother or the more “maternal” parent/caregiver, ancestry, our connection with our past, our sense of security, domestic life, real estate."
  },
  {
    "house": 5,
    "attributes": "Creative self-expression, pleasure and entertainment, all forms of “play”, speculation and gambling, pastimes, hobbies, attitude towards romance, romantic relationships, lovers as opposed to partners, attitude towards having fun, drama, adornments and costumes."
  },
  {
    "house": 6,
    "attributes": "Work and job (as opposed to career), techniques and methods, daily life, order, self-improvement, health, nutrition, attitude towards food, service, attitude towards service and co-workers, helpfulness, pets, attitude towards routine and organization, how we refine and perfect ourselves, aptitudes."
  },
  {
    "house": 7,
    "attributes": "Companionship, the alter ego, partnerships, one-to-one relationships, marriage, the first marriage, the “significant other”, business partnerships, competitors, our “shadow self”, lawyers, mediators, counselors, contracts."
  },
  {
    "house": 8,
    "attributes": "Transformation and crisis, our attitude towards crisis and change, sexuality, sex, death and rebirth, personal growth and transformation, regeneration, our partner’s resources, addictions, psychology, others’ money, taxes, divorce/alimony, inheritance."
  },
  {
    "house": 9,
    "attributes": "Our personal belief system, our sense of adventure, exploration, religious beliefs and personal philosophy, higher education, long-distance travel, morals, foreign languages and cultures, personal truths, publishing, commerce."
  },
  {
    "house": 10,
    "attributes": "Career and profession, contribution to society, position in society, social standing, reputation, material success and position, how we carve out an identity for ourselves, achievement, authority figures, paternal figures, the father or most “paternal” parent/caregiver, bosses, governments, attitude towards responsibility, attitude towards abiding by the law, desire for achievement."
  },
  {
    "house": 11,
    "attributes": "Acquaintances and friends, groups, organizations, hopes, wishes, aspirations, personal goals, our sense of our true inner purpose, our sense of the group, humanity."
  },
  {
    "house": 12,
    "attributes": "That which is hidden or below the surface, karma, self-undoing, soul growth, hidden strengths and hidden weaknesses, dreams, private affairs, lost items, hospitals and prisons, spiritual studies."
  }
]