[
  {
    "zodiac": "Aries",
    "element": "Fire",
    "mode": "Cardinal",
    "houseRuler": 1,
    "attributes": "Aries is the first sign of the zodiac, and Aries natives are the first to start—and the first to finish—whatever they set out to do. Aries is an active, energetic sign. People with Sun in Aries are direct, straightforward, and uncomplicated. They expect the same from others, and are baffled when they don’t always get it.\n\nThe body comes first with Aries. Sun in Aries people are natural athletes. At the very least, their natural inclination is to use their bodies to get things done. They’re not given to long, drawn-out emotional moments; nor are they big on planning ahead. Instead, they live their lives simply. What is happening right now is most important to Aries. Impatience is a definite vice, and innovation is a huge strength. Aries loves to start anything new, and they have trouble sitting still. They are pioneers in whatever they do, and there is a very basic quality of bravery in these people that is unmistakable! Aries generally knows what they want, and they know the quickest route to getting it. They take shortcuts if they must, but generally, everything is aboveboard. Underhanded just isn’t their style. Some Aries people are bold, but even the quieter ones are brave and even plucky in their own way. Independence is their birthright. Nothing gets them going more than a fresh slate, the promise of a new day, and a brand new start.\n\nAries enjoys a challenge, and Aries Suns are happiest when their lives are moving forward and active. There’s a childlike quality to all Aries Sun people, and it’s often quite charming."
  },
  {
    "zodiac": "Taurus",
    "element": "Earth",
    "mode": "Fixed",
    "houseRuler": 2,
    "attributes": "There is something very solid about Taurus natives, no matter what the rest of their charts say about them. Though they are dependable most of the time, this generally shows itself more in habit than in outright helpfulness.\n\nTaurus natives are sensual folk–and this includes sex, but extends to pleasures in all areas: they delight in the sensual pleasures of food, a comfortable blanket, a richly colored aquarium to look at, the smell of flowers or spring rain, pleasing melodies coming from their stereos, and so forth. Some might even say they live through their senses more than most.\n\nWhen Taurus natives work, they work hard. They do it with a steadiness that may rarely be considered quick–rather it’s a dependable, plodding, and steady effort that has its payoffs. Security is immensely important to Taurus–some of them actively seek wealth, while others are content to be “comfortable”. The Taurus attributes of “comfortable” may not be exactly the same as the rest of the signs, but comfort is definitely a driving force.\n\nAlthough hard-working, their fixed and comfort-loving nature sometimes makes them appear lazy. This is only because they separate work and leisure so well. When they work, they work hard, and when they play, they don’t really “play” as such…they relax. A Solar Taurus who has kicked his or her feet up is rooted there–you’d be hard-pressed to get them to move. On a mental level, you’ll likely have the same problem. Taureans stick with things and ideas, and therein lies one of the reasons why they are known for their stubbornness. Taurus is a fixed sign, and they have a fair measure of tradition and steadiness in their make-up that keeps them rooted.\n\nThe possessiveness associated with Taurus shows up in all areas of life in some way. Taurus likes to own things (and sometimes people). A nice home, a piece of land (this can be modest), a paid-off car, that aquarium mentioned earlier, a couple pets, maybe a solid business…In love and relationship, there is an earthy kind of possessiveness that may be considered jealousy by some, but there is actually quite a difference between being possessive and being jealous. Taurus natives are rarely jealous and petty. They do, however, think of the people they love as theirs–it adds to their sense of security."
  },
  {
    "zodiac": "Gemini",
    "element": "Air",
    "mode": "Mutable",
    "houseRuler": 3,
    "attributes": "With the Sun in Gemini, the urge for self-expression is strong. These natives are often just as interested in collecting information as they are in sharing it. Curious to a fault, Geminis have a finger in every pie.\n\nSolar Geminis are flexible and changeable people. Their ability to adapt quickly to new situations generally gains them plenty of friends and social contacts. Usually quite clever and witty, Geminis enjoy intellectual conversations and they are easily bored if they are not getting enough mental stimulation.\n\nOften quite adept at fitting in with others, Geminis easily adopt the moods of those around them. They are friends to people from all walks of life, and are not easily intimidated. Their ability to detach themselves can make Geminis very objective and observant, but a little difficult to get close to. Although they often have many friends, intimacy doesn’t come as easily to Solar Geminis.\n\nIt can be difficult to know what Gemini really feels at any given moment. They are often very impressionable and scattered. There is usually a nervous air to Geminis that can make more personal characters a little uneasy. It is not always intuitive to trust Geminis to be loyal or to keep secrets.\n\nGeminis often flit about, moving quickly and keeping busy every step of the way. Many people with this position of the Sun have gained quite a bit of knowledge in their lifetimes, but they don’t often possess specialized knowledge. This is because Geminis have relatively short attention spans. Restlessness is especially common with this position of the Sun.\n\nUsually quite affable, Geminis enjoy the “light” side of life. This tendency to take things lightly makes them quite pleasing to be around; but it can be maddening to people seeking support on the deeper issues in life.\n\nGeminis are both interesting and interested. Their wit can be dazzling and their changeability dizzying. At the very least, Geminis will seldom bore you."
  },
  {
    "zodiac": "Cancer",
    "element": "Water",
    "mode": "Cardinal",
    "houseRuler": 4,
    "attributes": "Sun in Cancer natives have a strong survival instinct. They are protective of those they care about, and of themselves too. They are often quite reticent about sharing their inner selves to the rest of the world, and are often caught up in reminisce.\n\nCancers have a reputation for moodiness, although this trait is most evident when the Moon is in Cancer. Cancer needs roots. They resist change to an extent, and concern themselves about being secure and safe in most everything they do.\n\nCancers can be quite intrigued by objects with history attached to them — antiques, photos, souvenirs, and the like.\n\nCancer is a very sensitive sign, and they don’t always appreciate it when you are blunt with them. Their reactions to hurt will depend on how thick a shell they have developed. Most Cancers react by withdrawing or retreating. Some have developed an ability to manipulate others to get what they want. They avoid direct confrontations almost as a rule.\n\nCancers are, in fact, quite yielding and soft when you have them in the right mood. They are one of the more hospitable signs of the zodiac. Sure, they can be touchy and indirect, but they are also very dependable, caring souls."
  },
  {
    "zodiac": "Leo",
    "element": "Fire",
    "mode": "Fixed",
    "houseRuler": 5,
    "attributes": "There’s an unmistakably regal air to Solar Leos. These are dignified—even noble—folk. Leos have a reputation for being conceited, but think again. Leos do feel important, but this generally takes the form of wanting to change the world in some way—to make the world a better place. They are generally motivated by affection for people, and often have big dreams and plans to make people happy.\n\nGenerally, Leos are hard-working. After all, they are attracted to the good things in life, and they know they have to work to get them. It is sometimes difficult to imagine Leos as go-getters if you happen to catch them in one of their languid moods. These people can sleep in, laze around, and luxuriate for long periods of time. However, when they do get to work, they do it with intensity and determination. In this way, they are not unlike their symbol, the lion.\n\nThe worst thing you can do to a Leo is accuse them of bad intentions. Displaying behavior that makes them think you don’t appreciate them runs a close second. These happy, jovial people become mighty hurt when others don’t see them for their noble intentions.\n\nLoyal, and sometimes rather traditional, Leos are, after all, a fixed sign. They’ll hold on to situations and people for a very long time before they give up. There is an unmistakable idealism to Leo’s view of the world and the people in it. Often, Leos have a very noble inner code that they answer to. Although on the surface, Leos appear rather confident, they can actually be some of the most humble souls around. They are the first to blame themselves when something goes wrong. Once again, it’s the Leonine self-importance at work, and this characteristic works in unexpected ways. Instead of being the conceited, self-absorbed show-offs of reputation, they are usually very self-aware, self-conscious, and, yes, even humble."
  },
  {
    "zodiac": "Virgo",
    "element": "Earth",
    "mode": "Mutable",
    "houseRuler": 6,
    "attributes": "It is rare to find the stereotypical nitpicky, exacting, “clean freak” in modern-day Virgos. Although the sign of Virgo has evolved with the times, there are some unmistakable traits that remain. Virgo people are generally respectable, hard-working individuals who have a love of knowledge and know-how.\n\nVirgo’s symbol, the Virgin, shows itself in the lives of Virgos through a love of all that is “natural” and a certain purity of spirit that keeps Virgos self-sufficient and self-contained, at least on the surface. Virgos are sensitive to their surroundings, and they tend to embarrass easily. They are generally reticent when faced with anything or anyone new. However, once they feel comfortable, they can talk up a storm. Many Virgo Suns are not too comfortable in the limelight. These types are just fine living in the background, as long as they feel useful and appreciated. Solar Virgos have a strong sense of responsibility. Even when they’ve convinced themselves to be irresponsible about something or the other, they worry about it.\n\nNot all Virgos are workaholics. However, when Solar Virgos are not involved in some kind of project, there is generally a vague feeling of discontent. Even when their lives are filled up with work, they are restless and somewhat nervous creatures. The fear of under-performing is often strong. Virgos want to do things well. Some are exacting and thorough, and those Virgos who have convinced themselves to do a less-than-perfect job will generally feel incomplete.\n\nVirgo, as an Earth sign, has a notable connection to the body. Solar Virgos are generally very body-aware. In some cases, this shows up as some form of hypochondria, but, for the most part, Virgo is simply quite concerned with health matters and nutrition. Virgo is attracted to all that is natural and pure, but is generally unafraid to explore all that is not. In fact, Virgo is an intensely curious sign. Still, there is a strong desire to remain pure on some level, despite all of Virgo’s curiosity and drive to know things. Those Virgos that find a true interest or “calling” easily become connoisseurs–their attention to details and enormous observation powers give them the ability to learn all of the ins and outs of any subject. These people love to do research, in addition to analytic or detail work. They’ll happily pick apart practically anything, although they are less adept at putting things back together, and often have trouble grasping the big picture.\n\nVirgo Suns who are stuck in the practical, material world may learn a lot about themselves if they are brave enough to try placing their lives on automatic pilot once in a while. Letting some things go will do wonders for their spirit. Virgos tend to be too hard on themselves. They worry about their health, their performance at work, all the things they haven’t done, and the emails that might be waiting for them while they are away from their computer. When they’re not feeling well, they can be overly critical and nervous. They fuss around, have a whole slew of assorted little complaints, and throw small tantrums.\n\nSolar Virgos are perfectionists–there’s simply no escaping it. They dream of mastery; they long to do something really well. Some Virgos are so scared of their own perfectionist qualities that they tell themselves they don’t care. Others will forever dabble into one thing or another, leaving a string of incomplete projects behind them. However, the happiest Virgos accept their need to get things right, without overdoing it. Probably the best advice for Sun in Virgo people is to find something that interests them–however small or large–and master it.\n\nMost Virgos can be rather private and fussy about their work, or their personal workspace. They get nervous when others look at their unfinished work, and they are quite protective of their methods of doing things. Despite an overall lack of confidence, Virgos can be mighty proud–even arrogant–when it comes to their work, routines, or hobbies. Secretly, they think their methods of doing things are the best. Often, they are! They do take pride in the little things they do, even though, in a broader sense, Virgos can be rather self-effacing and self-critical.\n\nSolar Virgos often confuse people when their curiosity is mistaken for passion. The surprising part is that Virgo, although knowledgeable, doesn’t always get its hands dirty. Their willingness to explore is often kept at the intellectual level. However, Virgos are often well-respected and valued in their circles for their loyalty, research skills, willingness to lend a hand, and their excellent powers of observation. They are generally kind and helpful souls who, when appreciated, do everything to make things work.\n\nThere’s an odd combination of the intellectual and the practical in Virgo that is sometimes mistaken for coolness. In fact, Virgos are often self-effacing and shy. They’ll brush off your compliments quickly and, sometimes, critically; but don’t let that fool you. They need your respect and appreciation. In fact, the happiest Virgos are the ones who feel appreciated and useful. Add plenty of worthwhile projects to keep them busy, and Virgos can be some of the sweetest, kindest people around."
  },
  {
    "zodiac": "Libra",
    "element": "Air",
    "mode": "Cardinal",
    "houseRuler": 7,
    "attributes": "Libra natives are generally thought to be sociable, somewhat intellectual souls. They have an almost innocent way about them that makes them very approachable. Generally quite eager to cooperate, Librans spend a lot of their time trying not to rock the boat.\n\nIn theory, Libras are peace-loving. In practice, they can quietly stir up all sorts of trouble with their ways. Because Libra enjoys balance in their lives, they seek the middle ground. In the process, they may end up trying to be everything to everyone. This is where their reputation for untruthfulness comes from. Generally, their untruths spring from a true desire for peace and fairness–although they may not be comfortable with direct and malicious trickery, they feel totally justified when they lie in order to avoid making waves. Peace at any price! In this sense, they seem harmless. But, what can result is quite a ruckus!\n\nPeople involved with Libras may crib about their lack of directness and their apparent inability to take a stand. Librans are experts at avoiding being the one to blame. When confronted, they’ll (calmly and reasonably) say, “What, me? No, I just want peace.”\n\n“On the fence”, “middle ground”, “middle road” — these are all expressions that we can safely associate with Libra.\n\nSome more powerful signs may consider Libra a little on the weak side. This is all a matter of opinion, however! Without Libra, life simply wouldn’t be as fair.\n\nLibrans are known for comparing and thinking in relative terms, instead of in absolutes. This weekend is not just a good weekend, it’s better than last weekend. These people are always looking for the “best” way or the “right” way to live. Harmony is the ultimate goal, but their idealism and high expectations can mean plenty of discontent. Since life presents all of us with an extraordinary amount of choices, if Libra doesn’t learn to live in the moment at least some of the time, they’ll be in a constant state of unrest.\n\nSociety needs rules, and these rules attempt to bring justice, equality, and fairness. On an individual level, Libra represents these laws of civilization. Libra comes across as very civilized and rather refined."
  },
  {
    "zodiac": "Scorpio",
    "element": "Water",
    "mode": "Fixed",
    "houseRuler": 8,
    "attributes": "Scorpios are known for their intensity. They are determined folk that absolutely throw themselves into whatever they do — but getting them to commit to something is rarely an easy task. In fact, it’s better not to even try to “get them” to do anything. Solar Scorpios absolutely have their own mind. And, their primary motivation is unlikely to be prestige (like their Capricorn friends), or even authority (Leos can have that, too)–it’s real power. Their power can absolutely be of the “behind the scenes” variety, just as long as they have it.\n\nTo others, Scorpios seem to have plenty of willpower. They probably do. Scorpios do know what they want, and they won’t go out and grab it at the wrong moment. They simply sit back, watch (quite expertly), and then get it only when the moment is just right. This apparent patience is simply their powerful skills at strategy at work.\n\nScorpio isn’t afraid of getting their hands (their bodies, their minds) dirty. The darker side of life intrigues them, and they’re always ready to investigate.\n\nScorpios simply never give up. They have tremendous staying power. They’re not in the slightest intimidated by anybody or anything. Confrontations are not a problem. In fact, talk to any Scorpio about their lives, and you’ll probably be in awe at all they’ve gone through. Trauma seems to follow them wherever they go. When Scorpio learns optimism, instead of expecting the worst, they’ll find that they possess amazing regenerative powers — the power to heal, create, and transform."
  },
  {
    "zodiac": "Sagittarius",
    "element": "Fire",
    "mode": "Mutable",
    "houseRuler": 9,
    "attributes": "Restless, cheerful, and friendly, Sun in Sagittarius people are generally on the go. They have a love of freedom, and a disdain for routine. Generally quite easygoing, Sagittarians make friends with people from all walks of life. They love to laugh and tease, and get along well with both sexes.\n\nSagittarians have an often blind faith in people, and in the world. Their optimism is infectious, although it can get them into trouble from time to time. These are curious people who love to learn. Their idealistic nature is hard to miss.\n\nAlthough generally easygoing, Sagittarius is a fire sign. This gives natives a generally quick temper. Fortunately, they’re usually as quick to forget what got them angry in the first place.\n\nThe need for escape is generally strong, and some Solar Sagittarians come across as a little irresponsible. They’re generally easy to forgive, however. After all, their direct, honest approach in life is admirable."
  },
  {
    "zodiac": "Capricorn",
    "element": "Earth",
    "mode": "Cardinal",
    "houseRuler": 10,
    "attributes": "Capricorn is a feet-on-the-ground, eye-on-the-prize sign. Those with Sun in Capricorn have a realistic, grounded approach to life that can be seen no matter how dreamy the rest of the birth chart suggests. These people know how to do things, and to get things done.\n\nSome Capricorns naturally turn their backs on things they deem too frivolous. They are very much concerned with things that are worthwhile—and that includes their own lives. Capricorns want to do and be something worthwhile. Like their Earth signs relatives, Taurus and Virgo, they need to feel useful and effective in the real world in order to be satisfied with their lives. But the Capricorn spin on the earth signs is that Capricorn possesses a stronger need for recognition in a worldly sense. They have a strong sense of society and its framework, and they feel most secure when they feel they are doing their part within that framework.\n\nCapricorns like to pare things down and take pleasure in the simple things in life. However, many are attracted to status symbols and these ones will wear the best clothes (tasteful ones!) and drive quietly impressive cars.\n\nComparing Capricorns to their symbol—the goat—brings up some interesting analogies. Solar Capricorns can see into the future, and plan for it. They don’t mind taking things slowly, but they absolutely aim to get to the top of the mountain in life! They make their way steadily and sure-footedly, and their strength and singleness of purpose are admirable.\n\nCapricorns can sometimes be rather lonely people, although they rarely let it show. They are often a little reserved—even standoffish. This is generally because they value all things practical, and they’ll seldom wear their emotions on their sleeves unless they have a particularly flamboyant Moon sign.\n\nThis is a sign that is surely the most resourceful of the zodiac. To some, Capricorns come across as unimaginative, but they can be enormously creative when it comes to the material world. They are generally very capable people with a strong sense of tradition and responsibility.\n\nMany Capricorns have mastered the art of making people laugh. Their sense of humor can be of the deadpan variety—they’re generally excellent at keeping a straight face. They can be bitingly sarcastic, too.\n\nCapricorns are not known for taking too many risks in life. They value the beaten track and things “tried and true”. This is not to say they are stick-in-the-muds — they simply value the hard work laid down by those who’ve been around before them.\n\nTurn to your Capricorn friends for help when you need to really get things done. They’ll have practical advice, and they’ll help you organize and manage your life a little better. Capricorns are generally good with their “word”, dependable, and rather loyal people."
  },
  {
    "zodiac": "Aquarius",
    "element": "Air",
    "mode": "Mutable",
    "houseRuler": 11,
    "attributes": "One of the standout characteristics of those born under the Sun Sign of Aquarius is their unwillingness to follow the beaten track. With advancement and progress on their minds, there can be an irreverence to old and outdated ways of thinking and doing things.\n\nMany Aquarians aim to free themselves of personal and social conditioning. Although open to change in theory, Aquarians can be surprisingly stubborn. Their idealism runs strong, but they can be very fixed in their opinions.\n\nOften a bit aloof and even standoffish, Aquarians nonetheless are usually well-liked. They are curious and observant, and tolerant in a broad sense. Prejudice and bias is offensive to the typical Aquarius.\n\nAquarians are generally very clever, witty, and intellectual. They value progress and frankness. It’s difficult to throw Aquarians for a loop—they’re generally on top of things.\n\nThere is a bit of reformer in Aquarius. They’ll try to get you to see through superficiality, and encourage you to be open and forthright. “Be true to yourself” and “Don’t follow the crowd” are mottos we easily associate with this sign.\n\nAquarians need space and value personal freedom. Any attempt to box them in will likely fail. They’ll happily return the favor, and they will treat people from all walks of life as equals. Equality and fairness are hallmarks of the sign. If you’re quirky and “different”, all the better."
  },
  {
    "zodiac": "Pisces",
    "element": "Water",
    "mode": "Mutable",
    "houseRuler": 12,
    "attributes": "As the twelfth and last sign of the zodiac, Pisces contains within itself a little experience of all the signs. This gives Pisces Suns the ability to identify with people from all walks of life—from all backgrounds—in some way. These individuals are not only changeable and adaptable, but they also have open minds and tremendous understanding. But Pisces itself is often misunderstood. Pisces Suns may spend a good portion of their lives yearning for understanding, and the other part in a state of divine discontent. Suffering is sometimes glamorized in the Piscean world.\n\nSun in Pisces people are frequently pegged as wishy-washy, but this is all a matter of opinion. What you will find behind a vaguely directionless, spacey manner is a deep person with real dreams. Their dreams are more than getting that picket fence or making it up the corporate ladder. Pisces are tuned in to a higher purpose and their dreams transcend the individual. A deep love for humanity and compassion that knows no bounds is found with this placement of the Sun.\n\nPisceans are not known to be cutthroat business types, nor are they given to throwing themselves out into the world in an aggressive manner. But make no mistake about it, Pisces can be extraordinarily successful when given the chance to express themselves. The arts, marketing, music, teaching, drama, healing arts…these are all fields in which Pisces can find expression. Their imagination, attunement to humanity, and remarkable intuition endow them with enviable gifts of insight and creativity.\n\nPisces is a sensitive sign—both sensitive to criticism and sensitive to others’ feelings. Easily touched by human suffering, at least in theory, Pisces wouldn’t hurt a fly. They believe in people, are deeply hurt by compassionless human behavior, and have a hard time saying no. Harsh realities are avoided either through escapist behavior or self-delusion; but every now and again reality does raise its ugly head and hits Pisces over the head. This is a sad time indeed. Pisces retreats into their own world, self-pitying and giving pep talks to themselves (“I will never trust again!”). Rest assured, though, that these periods are rather short-lived and even useful. Pisces seems to derive energy from their (generally short) bouts of self-pity. They come back stronger, with a spring in their step, ready to face the world again, and just as, if not more, compassionate and trusting as they were before. Some might even wonder if Pisces finds pleasure in suffering. Sometimes this is the case, but most of the time, Pisces pulls a lot of creative energy from sadness. Pisces is the poet or artist with angst, although this trait is often more apparent with Moon in Pisces.\n\nSome find Pisces’ tendency to be late for appointments, spaced out behavior, and absent-mindedness amount to irresponsibility. Pisces would be shocked to know this, however. Who me? Pisces wonders. Irresponsible? Pisces Suns absolutely care—their love knows no bounds—but their retreats from ordinary life (whether they are as simple as daydreams or actual departures) that they so seem to need every now and again are not always understandable to no-nonsense signs, such as Virgo or Aries.\n\nMany Pisces seem almost allergic to things like shopping lists, maps, directions, and instructions, and for some brave souls, even watches — they prefer to feel their way through life than to follow some plan.s"
  }
]